# 베이스 이미지를 명시해준다.
# 이미지 생성시에 기반이 되는 레이어
# 베이스 이미지도 레이어 중 하나이지만 가장 기본이 되는 레이어 인것임
# 이 베이스 이미지를 넣어줄때는
# <이미지 이름>:<태그> 형식으로 작성
# 태그를 안붙이면 자동적으로 가장 최신것으로 다운받음
# FROM BaseImage

# 추가적으로 필요한 파일들을 다운로드 받는다
# 도커 이미지가 생성되기 전에 수행할 쉘 명령어
# RUN command

# 컨테이너 시작 시 실행 될 실행 파일 또는 셀 스크립트
# 해당 명령어는 DockerFile내 1회만 사용할 수 있다.
# CMD["executable"]

# 실제 베이스를 넣어보자





# 베이스 이미지 명시
FROM alpine

# 도커 이미지가 생성되기 전에 수행할 쉘 명령어
# RUN command

# 컨테이너 시작 시 실행 될 실행 파일 또는 셀 스크립트
CMD["echo", "hello"]

# 그렇게 하기 위해서 docker build./ 또는 docker build . 명령어를 사용하여야 한다.

